export const elements = ["炎" , "水" , "雷" , "氷" , "岩" , "風" , "草"];
export const weapons = ["片手剣" , "両手剣" , "槍" , "弓" , "法器"];
export const weaponOptions: Record<string,string> = {
    片手剣: "/images/weapons/OneHandedSword.png",
    両手剣: "/images/weapons/TwoHandedSword.png",
    槍:"/images/weapons/Spear.png",
    弓:"/images/weapons/Bow.png",
    法器:"/images/weapons/RitualTools.png",
};
export const regions = ["モンド" , "璃月" , "稲妻" , "スメール" , "フォンテーヌ" , "ナタ" , "ナド・クライ" , "その他"];
export const ascensionStats = ["HP" , "攻撃力" , "防御力" , "元素熟知" , "会心率" , "会心ダメージ" , "与える治療効果" , "元素チャージ効率" , 
    "炎元素ダメージ", "水元素ダメージ" , "草元素ダメージ" , "雷元素ダメージ" , "風元素ダメージ" , "氷元素ダメージ" , "岩元素ダメージ" , "物理ダメージ"];
export const energyCosts = ["40族" , "50族" , "60族" , "70族" , "80族" , "90族"];
export const abilityOptions  = ["回復","自己回復","他キャラ回復","単体回復","全体回復", "蘇生能力","シールド効果",
    "攻撃力バフ", "防御力バフ", "防御力デバフ","元素ダメージバフ","与ダメージバフ:自キャラ","高頻度元素付着","元素付与:キャラ","元素付与:武器",
    "メイン火力","サブ火力","デコイ", "爆破" ,"重量判定", "吹き飛ばし効果","元素耐性バフ:自キャラ","元素耐性バフ",
    "スキルCTバフ:自キャラ","スキルCTバフ","元素チャージ効率バフ:自キャラ","元素チャージ効率バフ","会心率バフ:自キャラ","会心率バフ",
    "中断耐性バフ:自キャラ","中断耐性バフ", "移動速度バフ" , "移動スタミナバフ","攻撃速度バフ:自キャラ","攻撃速度バフ",
    "2U持ち","特殊な元素付着CT","スナップショット持ち","エネルギー緩和:自キャラ","エネルギー緩和",
    "一部攻撃無効化","初期配布キャラ","複数コスチューム持ち" ];