export const raritys = ["星5" , "星4"];
export const elements = ["炎" , "水" , "雷" , "氷" , "岩" , "風" , "草"];
export const weapons = ["片手剣" , "両手剣" , "槍" , "弓" , "法器"];
export const weaponOptions: Record<string,string> = {
    片手剣: "/images/weapons/OneHandedSword.png",
    両手剣: "/images/weapons/TwoHandedSword.png",
    槍:"/images/weapons/Spear.png",
    弓:"/images/weapons/Bow.png",
    法器:"/images/weapons/RitualTools.png",
};
export const regions = ["モンド" , "璃月" , "稲妻" , "スメール" , "フォンテーヌ" , "ナタ" , "ナド・クライ" , "その他"];
export const ascensionStats = ["HP" , "攻撃力" , "防御力" , "元素熟知" , "会心率" , "会心ダメージ" , "与える治療効果" , "元素チャージ効率" , 
    "炎元素ダメージ", "水元素ダメージ" , "草元素ダメージ" , "雷元素ダメージ" , "風元素ダメージ" , "氷元素ダメージ" , "岩元素ダメージ" , "物理ダメージ"];
export const energyCosts = ["40族" , "50族" , "60族" , "70族" , "80族" , "90族"];
export const modelTypes = ["長身男性", "長身女性" , "中背男性" , "中背女性" , "小柄女性"];
export const abilityOptions  = ["メイン火力","サブ火力","ドライバー","追撃能力:通常攻撃","追撃能力:重撃","回復","自己回復","他キャラ回復","単体回復","全体回復", "蘇生能力","シールド効果",
    "攻撃力バフ","攻撃力デバフ" ,"防御力バフ", "防御力デバフ","元素ダメージバフ:自キャラ","元素ダメージバフ","与ダメージバフ:自キャラ","受けるダメージ軽減","高頻度元素付着","元素付与:キャラ","元素付与:武器",
    "デコイ", "爆破" ,"重量判定", "吹き飛ばし効果","元素耐性バフ:自キャラ","元素耐性バフ","元素耐性デバフ","カウンター能力","通常攻撃バフ:自キャラ","通常攻撃バフ","重撃バフ:自キャラ",
    "スキルCTバフ:自キャラ","スキルCTバフ","元素チャージ効率バフ:自キャラ","元素チャージ効率バフ","会心率バフ:自キャラ","会心率バフ","自動攻撃","吸い寄せ効果",
    "中断耐性バフ:自キャラ","中断耐性バフ", "移動速度バフ" , "移動スタミナバフ","スタミナ消費減少","攻撃速度バフ:自キャラ","攻撃速度バフ","元素熟知バフ","受ける治療効果バフ",
    "2U持ち","4U持ち","特殊な元素付着CT","スナップショット持ち","エネルギー緩和:自キャラ","エネルギー緩和","CTリセット効果",
    "岩元素創造物","一部通行不可効果","一部攻撃無効化","初期配布キャラ","複数コスチューム持ち" ];

/* git update */

//git add .
//git commit -m "update"
//git push