
export type Character = {
    id: number;
    name : string;
    element: "炎" | "水" | "雷" | "氷" | "岩" | "風" | "草";
    weapon: "片手剣" | "両手剣" | "槍" | "弓" | "法器";
    region:"モンド" | "璃月" | "稲妻" | "スメール" | "フォンテーヌ" | "ナタ" | "ナド・クライ" | "その他";
    ascensionStat: "HP" | "攻撃力" | "防御力" | "元素熟知" | "会心率" | "会心ダメージ" | "与える治療効果" | "元素チャージ効率" | 
    "炎元素ダメージ" | "水元素ダメージ" | "草元素ダメージ" | "雷元素ダメージ" | "風元素ダメージ" | "氷元素ダメージ" | "岩元素ダメージ" | "物理ダメージ"; 
    energyCost: "40族" | "50族" |"60族" |"70族" |"80族" |"90族";
    abilities: string[];
    image: string;
};

export const characters: Character[] = [
  {
    "id": 1,
    "name": "アンバー",
    "element": "炎",
    "weapon": "弓",
    "region": "モンド",
    "ascensionStat": "攻撃力",
    "energyCost": "40族",
    "abilities": [
      "攻撃力バフ",
      "高頻度元素付着",
      "メイン火力",
      "サブ火力",
      "デコイ",
      "爆破",
      "重量判定",
      "吹き飛ばし効果",
      "移動速度バフ",
      "移動スタミナバフ",
      "初期配布キャラ",
      "2U持ち",
      "複数コスチューム持ち",
      "特殊な元素付着CT"
    ],
    "image": "/images/Ambor.png"
  },
  {
    "id": 2,
    "name": "ガイア",
    "element": "氷",
    "weapon": "片手剣",
    "region": "モンド",
    "ascensionStat": "元素チャージ効率",
    "energyCost": "60族",
    "abilities": [
      "回復",
      "自己回復",
      "単体回復",
      "シールド効果",
      "移動スタミナバフ",
      "吹き飛ばし効果",
      "サブ火力",
      "メイン火力",
      "高頻度元素付着",
      "初期配布キャラ",
      "2U持ち",
      "複数コスチューム持ち",
      "スナップショット持ち",
      "エネルギー緩和:自キャラ"
    ],
    "image": "/images/Kaeya.png"
  },
  {
    "id": 3,
    "name": "リサ",
    "element": "雷",
    "weapon": "法器",
    "region": "モンド",
    "ascensionStat": "元素熟知",
    "energyCost": "80族",
    "abilities": [
      "防御力デバフ",
      "メイン火力",
      "サブ火力",
      "吹き飛ばし効果",
      "中断耐性バフ:自キャラ",
      "初期配布キャラ",
      "2U持ち",
      "複数コスチューム持ち",
      "スナップショット持ち",
      "高頻度元素付着",
      "エネルギー緩和:自キャラ"
    ],
    "image": "/images/Lisa.png"
  },
  {
    "id": 4,
    "name": "バーバラ",
    "element": "水",
    "weapon": "法器",
    "region": "モンド",
    "ascensionStat": "HP",
    "energyCost": "80族",
    "abilities": [
      "回復",
      "自己回復",
      "他キャラ回復",
      "単体回復",
      "全体回復",
      "蘇生能力",
      "元素ダメージバフ",
      "高頻度元素付着",
      "元素付与:キャラ",
      "メイン火力",
      "移動スタミナバフ",
      "複数コスチューム持ち",
      "エネルギー緩和:自キャラ"
    ],
    "image": "/images/Barbara.png"
  },
  {
    "id": 5,
    "name": "レザー",
    "element": "雷",
    "weapon": "両手剣",
    "region": "モンド",
    "ascensionStat": "物理ダメージ",
    "energyCost": "80族",
    "abilities": [
      "中断耐性バフ:自キャラ",
      "元素耐性バフ:自キャラ",
      "攻撃速度バフ:自キャラ",
      "一部攻撃無効化",
      "エネルギー緩和:自キャラ",
      "メイン火力",
      "スキルCTバフ:自キャラ",
      "移動スタミナバフ",
      "元素チャージ効率バフ:自キャラ",
      "会心率バフ:自キャラ",
      "与ダメージバフ:自キャラ",
      "防御力デバフ",
      "爆破",
      "2U持ち"
    ],
    "image": "/images/Razor.png"
  },
  {
    "id": 6,
    "name": "香菱",
    "element": "炎",
    "weapon": "槍",
    "region": "璃月",
    "ascensionStat": "元素熟知",
    "energyCost": "80族",
    "abilities": [
      "攻撃力バフ",
      "元素耐性デバフ",
      "元素ダメージバフ",
      "サブ火力",
      "高頻度元素付着",
      "スナップショット持ち",
      "特殊な元素付着CT",
      "複数コスチューム持ち"
    ],
    "image": "/images/Xiangling.png"
  },
  {
    "id": 7,
    "name": "北斗",
    "element": "雷",
    "weapon": "両手剣",
    "region": "璃月",
    "ascensionStat": "雷元素ダメージ",
    "energyCost": "80族",
    "abilities": [
      "追撃能力:通常攻撃",
      "追撃能力:重撃",
      "シールド効果",
      "通常攻撃バフ:自キャラ",
      "重撃バフ:自キャラ",
      "攻撃速度バフ:自キャラ",
      "移動スタミナバフ",
      "受けるダメージ軽減",
      "中断耐性バフ",
      "元素耐性デバフ",
      "元素付与:キャラ",
      "サブ火力",
      "メイン火力",
      "2U持ち",
      "4U持ち",
      "吹き飛ばし効果",
      "カウンター能力",
      "スナップショット持ち",
      "高頻度元素付着"
    ],
    "image": "/images/Beidou.png"
  },
  {
    "id": 8,
    "name": "行秋",
    "element": "水",
    "weapon": "片手剣",
    "region": "璃月",
    "ascensionStat": "攻撃力",
    "energyCost": "80族",
    "abilities": [
      "サブ火力",
      "追撃能力:通常攻撃",
      "受けるダメージ軽減",
      "中断耐性バフ",
      "元素付与:キャラ",
      "他キャラ回復",
      "回復",
      "自己回復",
      "単体回復",
      "元素耐性デバフ",
      "与ダメージバフ:自キャラ",
      "元素ダメージバフ",
      "エネルギー緩和:自キャラ",
      "高頻度元素付着",
      "複数コスチューム持ち",
      "吹き飛ばし効果"
    ],
    "image": "/images/Xingqiu.png"
  }
];
